img2txt('Peiqi_1.jpg',1)

clc;
close all;
clear all;
A = imread('Peiqi.jpg');
B = rgb2gray(A);
B = imresize(B,[25,15]);
imwrite(B,'Peiqi_1.jpg')
% thresh = graythresh(A);   % 这里是进行阈值自设定，
% C = im2bw(A,thresh);      % 根据设定的阈值进行二值化操作
% imtool(B);
ft=fopen(strcat(['Peiqi','.txt']),'w');

[m,n] = size (B);
C = uint8(ones(m,n)*255);
for i =1:1:m
    fprintf(ft,'\n');
    for j = 1:1:n
%         fprintf('%d',B(i,j));
        if B(i,j)>235
            C(i,j) = 255;
            fprintf(ft,'%s','  ')
        elseif B(i,j) <= 235 && B(i,j) > 205
            C(i,j) = 210;
            fprintf(ft,'%s','~.~')
        elseif B(i,j) <= 205 && B(i,j) > 150
            C(i,j) = 180;
            fprintf(ft,'%s','&!&')
        elseif B(i,j) <= 150 && B(i,j) >90
            C(i,j) = 120;
            fprintf(ft,'%s','@,@')
        else
            C(i,j) = 0;
            fprintf(ft,'%s','#`#')
        end
    end
end
% imtool(C);
str='\n            ~.~~.~              \n        ~.~  ~.~~.~    ~.~~.~~.~    \n        ~.~~.~~.~~.~~.~~.~~.~~.~~.~~.~  \n        ~.~~.~~.~~.~~.~~.~~.~~.~&!&&!&  \n        ~.~~.~~.~~.~~.~&!&~.~~.~~.~~.~  \n        ~.~~.~&!&~.~~.~~.~~.~~.~~.~~.~  \n      ~.~~.~~.~~.~~.~~.~~.~~.~~.~~.~    \n      ~.~~.~&!&&!&~.~~.~~.~~.~       \n       ~.~&!&&!&&!&~.~~.~~.~~.~        \n      ~.~&!&&!&&!&~.~~.~~.~~.~~.~     \n       ~.~~.~~.~~.~~.~~.~~.~~.~       \n         ~.~~.~~.~~.~~.~~.~~.~     \n           ~.~~.~~.~~.~~.~~.~&!&      \n        ~.~&!&&!&&!&&!&&!&&!&&!&~.~     \n       &!&&!&&!&&!&&!&&!&&!&&!&&!&      \n      &!&&!&&!&&!&&!&&!&&!&&!&&!&      \n      &!&&!&&!&&!&&!&&!&&!&&!&&!&~.~    \n    ~.~&!&&!&&!&&!&&!&&!&&!&&!&&!&~.~    \n    ~.~&!&&!&&!&&!&&!&&!&&!&&!&&!&~.~    \n    ~.~&!&&!&&!&&!&&!&&!&&!&&!&&!&~.~    \n      ~.~~.~~.~~.~~.~~.~~.~~.~~.~      \n                              \n          ~.~&!&    ~.~~.~   \n               ~.~&!&    &!&&!&     \n   ';
fprintf('%s','That is all!');
error('MyComponent:incorrectType',...
str);
